assessments/teaching-portfolio/Teaching-Portfolio.tex
% Created 2021-04-10 Sat 23:15
% Intended LaTeX compiler: pdflatex
\documentclass[12pt]{report}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[]{minted}
\usepackage{tcolorbox}
\usepackage{etoolbox}
\def\mytitle{??? Program Code ???}
\BeforeBeginEnvironment{minted}{\begin{tcolorbox}[title=\hfill \mytitle]}%
\AfterEndEnvironment{minted}{\end{tcolorbox}}%
\usepackage{hyperref}
\usepackage{algorithmic}
\makeatletter
\AtBeginEnvironment{minted}{\dontdofcolorbox}
\def\dontdofcolorbox{\renewcommand\fcolorbox[4][]{##4}}
\makeatother
\usepackage[hmargin=25mm,vmargin=25mm]{geometry}
\setlength{\parskip}{1em}
\setlength{\parskip}{1em}
\usepackage[backend=biber,style=alphabetic]{biblatex}
\addbibresource{References.bib}
\usepackage{MyUnicodeSymbols}
\usepackage[dvipsnames]{xcolor} % named colours
\usepackage{color}
\definecolor{darkred}{rgb}{0.3, 0.0, 0.0}
\definecolor{darkgreen}{rgb}{0.0, 0.3, 0.1}
\definecolor{darkblue}{rgb}{0.0, 0.1, 0.3}
\definecolor{darkorange}{rgb}{1.0, 0.55, 0.0}
\definecolor{sienna}{rgb}{0.53, 0.18, 0.09}
\hypersetup{colorlinks,linkcolor=darkblue,citecolor=darkblue,urlcolor=darkgreen}
\setcounter{secnumdepth}{0}
\author{Curtis D'Alves}
\date{April 15, 2021}
\title{Teaching Portfolio}
\hypersetup{
 pdfauthor={Curtis D'Alves},
 pdftitle={Teaching Portfolio},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}



\setminted[haskell]{fontsize=\footnotesize}
\setminted[agda]{fontsize=\footnotesize}
\def\labelitemi{$\diamond$}
\def\labelitemii{$\circ$}
\def\labelitemiii{$\star$}

% Level 0                 Level 0
% + Level 1               ⋄ Level 1
%   - Level 2       --->      ∘ Level 2
%     * Level 3                   ⋆ Level 3
%

\begin{center}


\thispagestyle{empty}

{\color{white}{.}}

\vspace{5em}

{\Huge Professional Teaching Portfolio Of}

\vspace{1em}

{\Large \href{mailto:curtis.dalves@gmail.com}{Curtis D'Alves}}

\vspace{2em}
Ph.D Candidate and Sessional Instructor

Department of Computing and Software

McMaster University

\vspace{2em}
Last Edited: \today

\vfill

\def\mytitle{{\sc Contact \hspace{12em} \color{grey}{.} }}
\begin{minted}[]{haskell}
Email:                                                        curtis.dalves@gmail.com
Phone:                                                        +905-870-3907
\end{minted}
\end{center}

\thispagestyle{empty}
\tableofcontents
\newpage

\part{Teaching Philosophy}
\label{sec:org4f67baf}
\section{My core personal beliefs on teaching}
\label{sec:orgc449993}

\textbf{Teaching is a responsibility}. When a person assumes the role of teacher,
they take on the responsibility of guiding a learners experience. On the other
hand, the learner must yield a certain degree of trust with the teacher. This
is not to say a students learning experience solely relies on a teacher, but
it is necessary to recognize this dynamic to effectively understand the role.
It is a teachers responsibility to never betray the trust of a student, this
responsibility is multi-faceted and vast but put broadly the teacher must
always put the students well being first and foremost. This means results
achieved by conventional means of assessment cannot be the teachers only
priority.

\noindent
\textbf{Good teaching challenges and inspires students}. A teacher should offer the
students more than what can be offered through a textbook or pre-recorded
lectures. A teacher should present students with challenges to overcome, and
inspire them to want to do so of their own volition. I entered university with
a singular goal, acquire a degree. However during my first year of university,
I met a professor that I'd come to do a student research project with during
the summer that would change my outlook on education. He presented me with an
opportunity to do real research, and although I was highly under-qualified at
the time he set up series of challenges/stepping stones that allowed me to
work up to the level of competence necessary to be useful. I wish to inspire
other students the way he inspired me.

\noindent
\textbf{Teaching should be accessible}. Everyone should have access to education, and
teachers should be aware and accommodating of different accessibility issues
that their students may face. Teachers are often to quick to assume their
methods of assessment or presentation are the only reasonably effective way to
teach, and that it is the responsibility of the student to adapt to them no matter
their circumstances. This loses sight of the true goals of teaching, to give
students the skills and knowledge they need to succeed.

\section{My teaching strategies}
\label{sec:orgaa64c71}

\textbf{I employ Active Learning methods in my lectures and teaching material}.
Active learning makes use of various activities to break up the otherwise
passive experience of learning in traditional lectures. It puts a higher
degree of responsibility on the student, challenging them during the learning
process. And there is possibly no more appropriate field to employ active
learning then computing and software. Interfacing with a computer allows a
level of live assessment not achievable otherwise. By interspersing lecture
content with live coding activities and discussion sessions students have a
much deeper level of engagement with the material, and receive a much more
adequate level of feedback than conventional assessment methods. Regular
lecture sessions cease to be a passive experience where students show up
simply to listen to a professor present a topic and become a challenge for
learners to overcome.

\noindent
\textbf{I provide real world applications of concepts being taught wherever
possible}. Most students in STEM come to university with the dream of one day
acquiring the skills to build something truly useful. For these students, the
traditional university experience can be extremely disheartening. Whole
subjects (calculus for example) can seem like nothing more than a form of
academic hazing, meant to give students a hard time rather than provide them
with useful skills. When I taught my first sessional position, an experiential
learning based course in the second semester of the first year in a CS
program, I laid out a clear road map with an end goal of developing a Django
stack (Javascript - Python - Django - MySQL) web app managed under a GitHub
repository that they could showcase as part of their personal portfolio. I
found that as long as I could relate the concepts I was teaching as part of
this end goal students were far more inspired to engage with the content.

\noindent
\textbf{I design my course content following Universal Design for Learning
principles}. When appropriate, I provide course content in as many different
means of representation as reasonable. This means implementing redundancies
for visual and audio representation in lectures and video presentations, which
can be as simple as making sure to fully explain slide content verbally and
providing all verbally explained content in slides and text documents. I also
encourage note sharing (either for bonus marks or a means of assessment with
exemptions) to help students who have difficulty taking notes. Another
principle of Universal Design for Learning I follow is providing students with
multiple means of engaging with me. Although I encourage students to engage
with me directly in class or during office hours, I understand in person
experience can be anxiety inducing. I find online interfaces (like forums and
instant messaging / video conferencing) can be very effective alternatives for
these students.

\section{My goals as a teacher}
\label{sec:org7925636}

Although my teaching experience is limited, I already greatly value the
positive impacts I've had on my students. Of all the feedback I've received,
the most dear to me are from students from a different program who have stated
they were inspired by me to transfer into a computing program. The most
obvious goal any institutional teacher should have is for their students to
finish with a sufficient understanding of the course material. This is a very
valid goal and one I hold, however I don't limit myself there. My more
ambitious goal is to inspire students to want to continue learning. But this
isn't the only ambitious goal I have. I wish to not just acknowledge my
positive feedback but critically engage with and improve from my negative
feedback. The most common theme in my negative feedback (particularly from the
first few sessional positions I taught) revolve around having too high
expectations on students. I believe this stems partly from my desire to
challenge students, but also a personality flaw of lack of patience. One of
the greatest things about being a teacher is it challenges you to grow as a
person. It is my greatest goal that as I continue to improve as a teacher, I
continue to improve as a person.

\part{{\bfseries\sffamily TODO} Teaching Practice}
\label{sec:org69ff924}
\part{{\bfseries\sffamily TODO} Teaching Experience}
\label{sec:org380f684}
\section{{\bfseries\sffamily TODO} Teaching Assistantships}
\label{sec:org9f98ab5}
\section{{\bfseries\sffamily TODO} Guest Lectures}
\label{sec:orge4b0fb2}
\part{{\bfseries\sffamily TODO} Evidence of the Effects of Teaching}
\label{sec:org9a5e985}
\section{{\bfseries\sffamily TODO} Teaching Evaluations}
\label{sec:orgdf452a1}
\section{{\bfseries\sffamily TODO} Teaching Awards}
\label{sec:org5605521}
\section{{\bfseries\sffamily TODO} Observations of Teaching}
\label{sec:org769d12c}
\part{{\bfseries\sffamily TODO} Teaching Development}
\label{sec:orga6a7b41}
\section{{\bfseries\sffamily TODO} Programs and Certificates}
\label{sec:orgca37a7c}
\section{{\bfseries\sffamily TODO} Scholarship of Teaching and Learning}
\label{sec:orgb7591e4}
\section{{\bfseries\sffamily TODO} Conferences}
\label{sec:org274defa}
\section{{\bfseries\sffamily TODO} Teaching and Learning Networks}
\label{sec:org4266441}
\section{{\bfseries\sffamily TODO} Trained Delivered}
\label{sec:orgeabc00c}
\part{{\bfseries\sffamily TODO} Future Goals}
\label{sec:orgf301c28}
\section{{\bfseries\sffamily TODO} Short-Term Goals}
\label{sec:orgb08f3e6}
\section{{\bfseries\sffamily TODO} Long-Term Goals}
\label{sec:orgc62b64b}
\end{document}